**Lab | SQL Queries 9**

In [3]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [4]:
password = getpass()

········

In [5]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)

1. How many distinct (different) actors' last names are there?

In [11]:
data = pd.read_sql_query('SELECT count(DISTINCT last_name) unique_lastname_count FROM sakila.actor', engine)
data.head()

   unique_lastname_count
0                    121

2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [19]:
query2 = "SELECT r.rental_date, IF(dayofweek(r.rental_date)<=5, 'workday', 'weekend') day_type \
FROM sakila.rental r"
print(query2)
data2 = pd.read_sql_query(query2, engine)
display(data2.head())

SELECT r.rental_date, IF(dayofweek(r.rental_date)<=5, 'workday', 'weekend') day_type FROM sakila.rental r

          rental_date day_type
0 2005-05-24 22:53:30  workday
1 2005-05-24 22:54:33  workday
2 2005-05-24 23:03:39  workday
3 2005-05-24 23:04:41  workday
4 2005-05-24 23:05:21  workday

3. Get all films with ARMAGEDDON in the title.

In [25]:
query3 = "SELECT f.title \
FROM sakila.film f \
WHERE f.title LIKE '%%ARMAGEDDON%%'"
print(query3)
data3 = pd.read_sql_query(query3, engine)
display(data3.head(10))

SELECT f.title FROM sakila.film f WHERE f.title LIKE '%%ARMAGEDDON%%'

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

4. Get 10 the longest films.

In [28]:
query4 = "SELECT title, length \
FROM sakila.film f \
ORDER BY length DESC \
LIMIT 10"
print(query4)
data4 = pd.read_sql_query(query4, engine)
display(data4.head(10))

SELECT title, length FROM sakila.film f ORDER BY length DESC LIMIT 10

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

5. How many films include Behind the Scenes content?

In [30]:
query5 = "SELECT count(title) \
FROM sakila.film f \
WHERE special_features LIKE '%%Behind the Scenes%%'"
print(query5)
data5 = pd.read_sql_query(query5, engine)
display(data5.head())

SELECT count(title) FROM sakila.film f WHERE special_features LIKE '%%Behind the Scenes%%'

   count(title)
0           538

6. Which kind of movies (rating) have a mean duration of more than two hours?

In [31]:
query6 = "SELECT rating, AVG(length) average_duration \
FROM sakila.film \
GROUP BY rating \
HAVING average_duration >= 120"
print(query6)
data6 = pd.read_sql_query(query6, engine)
display(data6.head())

SELECT rating, AVG(length) average_duration FROM sakila.film GROUP BY rating HAVING average_duration >= 120

  rating  average_duration
0  PG-13          120.4439

7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [36]:
query7 = "SELECT title, length, RANK() OVER( \
ORDER BY length DESC) length_rank \
FROM sakila.film \
WHERE length IS NOT null OR 0"
print(query7)
data7 = pd.read_sql_query(query7, engine)
display(data7)

SELECT title, length, RANK() OVER( ORDER BY length DESC) length_rank FROM sakila.film WHERE length IS NOT null OR 0

                   title  length  length_rank
0          CHICAGO NORTH     185            1
1         CONTROL ANTHEM     185            1
2         DARN FORRESTER     185            1
3            GANGS PRIDE     185            1
4              HOME PITY     185            1
..                   ...     ...          ...
995         ALIEN CENTER      46          996
996            IRON MOON      46          996
997        KWAI HOMEWARD      46          996
998     LABYRINTH LEAGUE      46          996
999  RIDGEMONT SUBMARINE      46          996

[1000 rows x 3 columns]